# Вход: четем броя на числата
n = int(input())

# Инициализация на променлива за сумата на числата
sum_numbers = 0

# Обхождане на числата с while цикъл
counter = 0
while counter < n:
    number = int(input())  # Четем текущото число
    sum_numbers += number  # Добавяме числото към сумата
    counter += 1           # Увеличаваме брояча с 1

# Изчисляване на средното аритметично
average = sum_numbers / n

# Отпечатваме резултата форматиран до втория знак след десетичната запетая
print(f"{average:.2f}")

# А сега със For цикъл
# Вход: четем броя на числата
n = int(input())

# Инициализация на променлива за сумата на числата
sum_numbers = 0

# Обхождане на числата с for цикъл
for _ in range(n):
    number = int(input())  # Четем текущото число
    sum_numbers += number  # Добавяме числото към сумата

# Изчисляване на средното аритметично
average = sum_numbers / n

# Отпечатваме резултата форматиран до втория знак след десетичната запетая
print(f"{average:.2f}")
