# Въвеждане на входните данни
x1 = float(input())  # Координата x на долния ляв ъгъл
y1 = float(input())  # Координата y на долния ляв ъгъл
x2 = float(input())  # Координата x на горния десен ъгъл
y2 = float(input())  # Координата y на горния десен ъгъл
x = float(input())   # Координата x на точката
y = float(input())   # Координата y на точката

# Проверка дали точката е върху някоя от страните на правоъгълника
if ((x == x1 or x == x2) and (y1 <= y <= y2)) or ((y == y1 or y == y2) and (x1 <= x <= x2)):
    print("Border")
else:
    print("Inside / Outside")
