# Основен цикъл, който продължава докато не се въведе "End" за дестинация
while True:
    destination = input()  # Въвеждаме името на дестинацията
    if destination == "End":  # Проверка за край на програмата
        break  # Прекратяване на цикъла

    # Четем необходимия бюджет за текущата дестинация
    min_budget = float(input())

    # Инициализиране на текущите спестявания
    current_savings = 0

    # Четене на суми, докато не се съберат достатъчно средства
    while current_savings < min_budget:
        amount_saved = float(input())  # Въвеждане на сума, която е спестена
        current_savings += amount_saved  # Добавяме сумата към текущите спестявания

    # Когато съберем достатъчно средства за текущата дестинация
    print(f"Going to {destination}!")
